src/cf/InformationRegisters/ДанныеПоНарушители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПоНарушители</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отдел</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияПрохода</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеПоНарушители/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
 
 Процедура ЗаписьДанных(Объект, Движения)Экспорт 
	 
	 Отдел = Объект.Отдел; 
	 Дата  = Объект.Дата; 
	 Движения.ДанныеПоНарушители.Записывать = Истина;
	 Для Каждого ТекСтрокаТабличнаяЧасть Из Объект.ТабличнаяЧасть Цикл
		 Движение = Движения.ДанныеПоНарушители.Добавить();
		 Движение.Период      = Дата;
		 Движение.Отдел       = Отдел;
		 Движение.Объект      = ТекСтрокаТабличнаяЧасть.Объект;
		 Движение.Направление = ТекСтрокаТабличнаяЧасть.Направление;
	 КонецЦикла;   
	 
 КонецПроцедуры
 
 #КонецОбласти
